% 2.1
a=[100,30,67,80,1,75,45]
% 2.1.1
% a(7)
% 2.1.2
% a([1,3,5])
% 2.1.3
% a(4:end)
% 2.1.4
% la=abs(a)>70
% a(la)
% 
% 
% 2.2
%  a=[1,-23,-42,-3]
% p=zeros(length(a),length(a))
% for i=1:1:length(a)
%     p(i,:)=(a).^(i-1)
% end
% 
% 2.3
% a=[-4,-2,0,2,4;-3,-1,1,3,5]
% la=abs(a)>3
% a(la)
%  
% 2.4
% a=[30,17,0,7,1;-3,13,1,17,81]
% la=(a>10)&(a<20)
% a(la)
% 
% 2.5
% num=conv([1 0 2],[1 5 4])
% den=[1 0 1 1]
% [q,r]=deconv(num,den)
% disp(['ÉÌ:',poly2str(q,'x')]),
% disp(['ÓàÊ½:',poly2str(r,'x')])
% 
% 2.6
% a=rand(3)
% p=poly(a)
% 
